# Python Tutorial 02:

# Working with Pandas Dataframes in Python


___

_Sherman6,  2020 March_

___

### Key Concepts Covered:  

___

* __[1. The Basics: Descriptive Functions](#first-bullet)__
    * A sampling of a few basic descriptive functions which can help you explore your dataset. 
* __[2. Various Methods for Appending Rows (Adding More Cases)](#second-bullet)__  
* __[3. Various Methods for Filtering & Selecting Rows](#third-bullet)__  
    * __[How to filter rows by a list of keywords](#third-sub-bullet)__
* __[4. Various Methods for Removing Rows & Missing Data](#fourth-bullet)__  
* __[5. The Importance of Row Indexing](#fifth-bullet)__  
    * __[How to reset row indices](#sixth-bullet)__
* __[6. Appending and Removing Columns, & Why Data Type Matters](#seventh-bullet)__
    * __[Why variable type matters](#seventh-sub1-bullet)__
    * __[Dropping (removing) columns](#seventh-sub2-bullet)__
* __[7. Merging and Joining Dataframes (A Simple Primer)](#eighth-bullet)__
* __[Appendix](#appendix)__
    * References, More Resources, & Machine Information 
   
___

- _For basic dataframe troubleshooting, such as assigning or changing dataframe values, see [Tutorial 1](https://nbviewer.jupyter.org/github/sherman6/tutorials/blob/master/Tutorial-01-Python-Basic_troubleshooting_and_usability_tips-v01.ipynb)_.  
- _For basic python troubleshooting, such as working with lists or dataframes, see [Tutorial 1](https://nbviewer.jupyter.org/github/sherman6/tutorials/blob/master/Tutorial-01-Python-Basic_troubleshooting_and_usability_tips-v01.ipynb)_.  

___

### Introduction:

Python's popularity continues to grow, with it becoming the #1 coding language preferred by those holding data science positions in 2019, according to Burtch Works [[1]](#reference).  __Pandas DataFrames__ have been ubiquitous in Python data analysis for several years now, and remain a popular framework for working with many types of data.  They provide an intuitive table-like structure, familiar to many who have worked with traditional datasets, where columns are data fields (aka variables) and rows represent cases (aka observations) of data.  Therefore, making a table 'wider' involves adding additional fields, while making a table 'longer' involves appending more rows of data to it.  

- Pandas is supported by a robust and dedicated team with great documentation, which can be found at [pandas.pydata.org](https://pandas.pydata.org/pandas-docs/stable/index.html#) [[2]](#reference).  

- Additional resources are located in ['More Resources'](#reference) at the end of this workbook.

___

### Purpose:

#### In each of these tutorials, I will demonstrate a few tips and tricks which will hopefully help others troubleshoot code in Python.  

___


One of Python's benefits is that there are often many different ways to achieve something.  However, there are often _even more ways_ one can get stuck trying to figure it out.  

In my experience, seeing examples of __"the wrong way"__ to code is just as educational as seeing __"the right way"__ to code, so in several places I show examples of things that DON'T work, the error messages resulting from them, and why those messages appear. 

Furthermore, I've spent my fair share of hours [Googling](https://www.google.com), [Stack Overflow-ing](https://stackoverflow.com/), and [GitHub-ing](https://github.com/) to find solutions, as well as a decent amount of time on some very informative and robust free tutorial websites, such as [W3Schools](https://www.w3schools.com/), [TutorialsPoint](https://www.tutorialspoint.com/python/index.htm), and [R-Bloggers](https://www.r-bloggers.com/) (the first that come to mind).  
- While there are some great documentation and tutorials out there, I find myself __jumping from one to the next__, until I have __dozens of browser tabs open__, as each focuses _very in-depth_ on a specific command, library, function, or variable type.  


- That is why I'm designing these tutorials to be __broad, rather than deep__.  These tutorials are __not designed to be exhaustive__, but rather to help troubleshoot when you get stuck, and share a few helpful tips along the way. 



A few final comments:

- Outside sources for additional guidance are listed throughout. 

- I intend to add to this tutorial as time goes on, to address recurring topics or popular questions.

- This workbook assumes familiarity with Python 3 and Jupyter Notebooks.


___

In [1]:
#Importing packages:
import numpy as np
import pandas as pd

<a class="anchor" id="first-bullet"></a>
___
___
___

## 1. Dataframes - The Basics: Descriptive Functions


Let's go over a few basic descriptive functions  which can help you explore your dataset.  Many of these work equally well outside of pandas.  __This section is by no means comprehensive__, as there are plenty more useful functions and packages that can help you explore your data.  

Here are few helpful methods when you want to know how to get a first glance at your dataframe. 



_For an introduction to dataframes, see [Tutorial 1](https://nbviewer.jupyter.org/github/sherman6/tutorials/blob/master/Tutorial-01-Python-Basic_troubleshooting_and_usability_tips-v01.ipynb)_.  
___

First, let's create a basic dataframe.  Let's assume we have a group of students in an educational program.

In [2]:
mydataframe = pd.DataFrame({
    'name': ['John','Tom','Jane','Sally','Viktor','Jesus','Nadia','Carlos','Omar'],
    'age': [20, 25, 19, 33, 45, 37, None, 42, 23],
    'score_math': [.85, .90, None, .99, .97, .88, .79, .92, .96],
    'score_language': [.85, .91, .94, 1.00, .82, .75, .89, .87, .88],
    'awards': ['','Scholarship, AAA Award','','Scholarship, AAA Award','Scholarship',\
               'Scholarship','','Resident Award','Scholarship']
    })

In [3]:
mydataframe

     name   age  score_math  score_language                  awards
0    John  20.0        0.85            0.85
1     Tom  25.0        0.90            0.91  Scholarship, AAA Award
2    Jane  19.0         NaN            0.94
3   Sally  33.0        0.99            1.00  Scholarship, AAA Award
4  Viktor  45.0        0.97            0.82             Scholarship
5   Jesus  37.0        0.88            0.75             Scholarship
6   Nadia   NaN        0.79            0.89
7  Carlos  42.0        0.92            0.87          Resident Award
8    Omar  23.0        0.96            0.88             Scholarship

What data type is the object (It's a Pandas DataFrame).

In [4]:
type(mydataframe)

pandas.core.frame.DataFrame

How to view the object's dimensions:

In [5]:
mydataframe.shape

(9, 5)

Since it's a Pandas DataFrame, it's essentially a table, therefore you can expect to see two dimensions.
- First # is rows
- Second # is columns 

___

How to view the length of the dataframe (how many rows it has):

In [6]:
len(mydataframe)

9

Alternate method to view the dataframe's length:

In [7]:
len(mydataframe['name'])

9

How to show the first few rows of the data, using a few different methods:

In [8]:
mydataframe.head()

     name   age  score_math  score_language                  awards
0    John  20.0        0.85            0.85
1     Tom  25.0        0.90            0.91  Scholarship, AAA Award
2    Jane  19.0         NaN            0.94
3   Sally  33.0        0.99            1.00  Scholarship, AAA Award
4  Viktor  45.0        0.97            0.82             Scholarship

In [9]:
mydataframe.head(3) #shows only 3 rows.

   name   age  score_math  score_language                  awards
0  John  20.0        0.85            0.85
1   Tom  25.0        0.90            0.91  Scholarship, AAA Award
2  Jane  19.0         NaN            0.94

In [10]:
mydataframe[1:4] #show only rows 2,3,4

    name   age  score_math  score_language                  awards
1    Tom  25.0        0.90            0.91  Scholarship, AAA Award
2   Jane  19.0         NaN            0.94
3  Sally  33.0        0.99            1.00  Scholarship, AAA Award

In [11]:
pd.set_option('display.max_colwidth', 10) #restricts the column width displayed to only 10 characters wide. 
mydataframe[1:4]

    name   age  score_math  score_language     awards
1    Tom  25.0       0.90        0.91       Schola...
2   Jane  19.0        NaN        0.94
3  Sally  33.0       0.99        1.00       Schola...

Note, changing `set_option` does not change the underlying data.

In [12]:
pd.set_option('display.max_colwidth', 100)  #Changing width for illustration purposes.

Showing the last few rows of data.

In [13]:
mydataframe.tail()

     name   age  score_math  score_language          awards
4  Viktor  45.0        0.97            0.82     Scholarship
5   Jesus  37.0        0.88            0.75     Scholarship
6   Nadia   NaN        0.79            0.89
7  Carlos  42.0        0.92            0.87  Resident Award
8    Omar  23.0        0.96            0.88     Scholarship

In [14]:
mydataframe.tail(2) #only shows 2 rows.

     name   age  score_math  score_language          awards
7  Carlos  42.0        0.92            0.87  Resident Award
8    Omar  23.0        0.96            0.88     Scholarship

### Descriptives for variables in a dataframe:

How to get summary statistics for each field:

In [15]:
mydataframe.describe()

             age  score_math  score_language
count   8.000000    8.000000        9.000000
mean   30.500000    0.907500        0.878889
std    10.141851    0.067135        0.071141
min    19.000000    0.790000        0.750000
25%    22.250000    0.872500        0.850000
50%    29.000000    0.910000        0.880000
75%    38.250000    0.962500        0.910000
max    45.000000    0.990000        1.000000

How to get summary statistics for one single field:

In [16]:
mydataframe['score_math'].describe()

count    8.000000
mean     0.907500
std      0.067135
min      0.790000
25%      0.872500
50%      0.910000
75%      0.962500
max      0.990000
Name: score_math, dtype: float64

How to get counts/frequencies for categorical and text fields:

In [17]:
mydataframe['awards'].value_counts()

Scholarship               3
                          3
Scholarship, AAA Award    2
Resident Award            1
Name: awards, dtype: int64

In [18]:
mydataframe['score_math'].value_counts()

0.79    1
0.90    1
0.85    1
0.97    1
0.96    1
0.99    1
0.88    1
0.92    1
Name: score_math, dtype: int64

How to get summary statistics for categorical and text fields:

In [19]:
mydataframe.groupby('awards').count()

                        name  age  score_math  score_language
awards
                           3    2           2               3
Resident Award             1    1           1               1
Scholarship                3    3           3               3
Scholarship, AAA Award     2    2           2               2

How to make a pivot table (this is not the best example of the `pivot_table()` command; it can be more robust):

In [20]:
mydataframe.pivot_table(index='awards', columns='name', values='age')

name                    Carlos  Jane  Jesus  John  Omar  Sally   Tom  Viktor
awards
                           NaN  19.0    NaN  20.0   NaN    NaN   NaN     NaN
Resident Award            42.0   NaN    NaN   NaN   NaN    NaN   NaN     NaN
Scholarship                NaN   NaN   37.0   NaN  23.0    NaN   NaN    45.0
Scholarship, AAA Award     NaN   NaN    NaN   NaN   NaN   33.0  25.0     NaN

___

How to display the highest values in a dataframe, for a particular field:

In [21]:
mydataframe['score_math'].nlargest(4)

3    0.99
4    0.97
8    0.96
7    0.92
Name: score_math, dtype: float64

How to display the smallest or lowest values in a dataframe, for a particular field:

In [22]:
mydataframe['age'].nsmallest(3)

2    19.0
0    20.0
8    23.0
Name: age, dtype: float64

___

How to fill na's with an arbitrary value (for example, zero):  
- This replaces missing values with a new value.

In [23]:
mydataframe['age'] = mydataframe['age'].fillna(0)

In [24]:
mydataframe['age']

0    20.0
1    25.0
2    19.0
3    33.0
4    45.0
5    37.0
6     0.0
7    42.0
8    23.0
Name: age, dtype: float64

Now, the row of index 6 (the 7th row) has a value of '0', instead of `NaN` (no value).

In [25]:
mydataframe.loc[6,'age'] = None #Changing it back (it was for illustration purposes only):
#mydataframe['age'][6] #For illustration purposes, we changed it back to 'no value' (nan).

<a class="anchor" id="second-bullet"></a>
___
___
___

## 2. Dataframes - Various Methods for Appending Rows (Adding More Cases)

There are several ways to add new cases of data onto an existing dataframe.  Here are a few.

Let's say four students from the class form a math team, represented by `ourdataframe`.

In [26]:
ourdataframe = mydataframe[0:3] #adds John, Tom, Jane
ourdataframe = ourdataframe.append(mydataframe[7:8]) #adds Carlos
ourdataframe = ourdataframe.reset_index(drop=True)
ourdataframe = ourdataframe.drop(columns=['score_language'])
ourdataframe

     name   age  score_math                  awards
0    John  20.0        0.85
1     Tom  25.0        0.90  Scholarship, AAA Award
2    Jane  19.0         NaN
3  Carlos  42.0        0.92          Resident Award

Let's say two new students join that team.  __How do we add new cases to a pandas dataframe?__    

This would entail appending new rows to the pandas dataframe. 
- First, ensure the new rows you want to add are in the same format (ours are).

In [27]:
df_newstudents = pd.DataFrame({
    'name': ['Marly','Hakkan'],
    'age': [28, 39],
    'score_math': [.91, .98],
    'awards': ['', 'Scholarship']
    })

In [28]:
df_newstudents

     name  age  score_math       awards
0   Marly   28        0.91
1  Hakkan   39        0.98  Scholarship

The two new students are Marly and Hakkan.  

Now, we append those new rows to the dataframe:

In [29]:
new_df = ourdataframe.append(df_newstudents)

In [30]:
new_df

     name   age  score_math                  awards
0    John  20.0        0.85
1     Tom  25.0        0.90  Scholarship, AAA Award
2    Jane  19.0         NaN
3  Carlos  42.0        0.92          Resident Award
0   Marly  28.0        0.91
1  Hakkan  39.0        0.98             Scholarship

We now have 6 students on the team.

- Notice that the row index for the new rows starts at '0', and is not a continuation of the previous dataframe's listing.  
- This becomes important when operating on this dataframe with 'for' loops, as well as index-based selection, as we will explain later (see '[How to reset row indices](#sixth-bullet)'). 

___

__Another method for adding new rows of data: copying existing rows.__

- Maybe you want to start a new case of data by using an existing case of data as a foundation. 
- We can copy an existing row and edit the resulting copy. 


Let's say Carlos' twin sister, Becky, joins the team, and shares some of the same characteristics as Carlos (she also garnered a Resident Award).

In [31]:
new_df = new_df.append(new_df[3:4]).reset_index(drop=True) 
#copy the row for 'Carlos', add it to the end of the dataset.

In [32]:
new_df

     name   age  score_math                  awards
0    John  20.0        0.85
1     Tom  25.0        0.90  Scholarship, AAA Award
2    Jane  19.0         NaN
3  Carlos  42.0        0.92          Resident Award
4   Marly  28.0        0.91
5  Hakkan  39.0        0.98             Scholarship
6  Carlos  42.0        0.92          Resident Award

Row 7 has been added, a copy of 'Carlos', row 4.

Now, let's edit this row's data appropriately for Becky's details.
- _Note, you must reset the row index in order to assign values in this manner. We've done so, above_ (`reset_index()`).

In [33]:
new_df.loc[6,'name'] = "Becky" 
new_df.loc[6,'score_math'] = .75

In [34]:
new_df

     name   age  score_math                  awards
0    John  20.0        0.85
1     Tom  25.0        0.90  Scholarship, AAA Award
2    Jane  19.0         NaN
3  Carlos  42.0        0.92          Resident Award
4   Marly  28.0        0.91
5  Hakkan  39.0        0.98             Scholarship
6   Becky  42.0        0.75          Resident Award

We now have a new row for 'Becky', Carlos' sister, completed with her updated details.

<a class="anchor" id="third-bullet"></a>
___
___
___

## 3. Dataframes - Various Methods for Filtering & Selecting Rows:

Here is our existing class of students:

In [35]:
mydataframe

     name   age  score_math  score_language                  awards
0    John  20.0        0.85            0.85
1     Tom  25.0        0.90            0.91  Scholarship, AAA Award
2    Jane  19.0         NaN            0.94
3   Sally  33.0        0.99            1.00  Scholarship, AAA Award
4  Viktor  45.0        0.97            0.82             Scholarship
5   Jesus  37.0        0.88            0.75             Scholarship
6   Nadia   NaN        0.79            0.89
7  Carlos  42.0        0.92            0.87          Resident Award
8    Omar  23.0        0.96            0.88             Scholarship

___

Let's say we only wanted to view students who scored 95% or higher in math.

How to filter rows by a column's value (numeric variable):

In [36]:
mydataframe.loc[mydataframe['score_math']>=.95]

     name   age  score_math  score_language                  awards
3   Sally  33.0        0.99            1.00  Scholarship, AAA Award
4  Viktor  45.0        0.97            0.82             Scholarship
8    Omar  23.0        0.96            0.88             Scholarship

Let's say we only wanted to view the top 3 students in language skills.

How to select the top # of rows with the highest values for a particular field:

In [37]:
mydataframe.nlargest(3,'score_language')

    name   age  score_math  score_language                  awards
3  Sally  33.0        0.99            1.00  Scholarship, AAA Award
2   Jane  19.0         NaN            0.94
1    Tom  25.0        0.90            0.91  Scholarship, AAA Award

Let's say we wanted to view the bottom 3 students in math.

How to select the rows with the smallest or lowest values for a particular field:

In [38]:
mydataframe.nsmallest(3,'score_math')

    name   age  score_math  score_language       awards
6  Nadia   NaN        0.79            0.89
0   John  20.0        0.85            0.85
5  Jesus  37.0        0.88            0.75  Scholarship

___

By contrast, the following method is improper and will result in errors when attempting to select the `nsmallest` or `nlargest`.
- This is because it is trying to pass a list to `.loc`.

In [39]:
mydataframe.loc[mydataframe['score_language'].nlargest(3)]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

     name   age  score_math  score_language                  awards
1.00  Tom  25.0         0.9            0.91  Scholarship, AAA Award
0.94  NaN   NaN         NaN             NaN                     NaN
0.91  NaN   NaN         NaN             NaN                     NaN

This error causes NaN values to incorrectly appear for all other datafields.  As you can see above, after the first row, no data is returned (all data is missing). They appear to be all blank (even though there is actually data in them).

___

### Filtering & selecting rows: Working with strings

Let's say we only wanted to view the students who had received a Scholarship, and no other awards (an exact match to the word, "Scholarship").

How to filter rows by a column's value (string variable):

In [40]:
mydataframe.loc[mydataframe['awards']=='Scholarship']

     name   age  score_math  score_language       awards
4  Viktor  45.0        0.97            0.82  Scholarship
5   Jesus  37.0        0.88            0.75  Scholarship
8    Omar  23.0        0.96            0.88  Scholarship

___

Let's say we only wanted to view the students who had received a Scholarship, including those who may have also received other awards.


How to filter a dataframe by a string variable containing certain text (how to only select rows which contain a certain string of text, such as a character, symbol, or word):

In [41]:
mydataframe[mydataframe['awards'].str.contains('Scholarship')]

     name   age  score_math  score_language                  awards
1     Tom  25.0        0.90            0.91  Scholarship, AAA Award
3   Sally  33.0        0.99            1.00  Scholarship, AAA Award
4  Viktor  45.0        0.97            0.82             Scholarship
5   Jesus  37.0        0.88            0.75             Scholarship
8    Omar  23.0        0.96            0.88             Scholarship

This `str.contains()` method works by partial matches.

In [42]:
mydataframe[mydataframe['awards'].str.contains('Res')]

     name   age  score_math  score_language          awards
7  Carlos  42.0        0.92            0.87  Resident Award

___
### Another way (more verbose): How to count the number of times a character appears in a string cell.

This involves creating a new, temporary column to be used as a flag for whether the condition was met. 

___

Let's say we wanted to view the students who had received an "AAA Award".


- Let's start by looking at one particular cell:

In [43]:
mydataframe['awards'][1] #Here is the cell we're looking at:

'Scholarship, AAA Award'

How to count the number of times 'Scholarship' appears in this string:

In [44]:
mydataframe['awards'][1].count('Scholarship')

1

How to count the number of times the character 'A' appears in this string:

In [45]:
mydataframe['awards'][1].count('A')

4

We can combine the above function with a logical operator (is the result greater than 3?) to determine whether an 'AAA Award' was achieved by that particular student.  In this way, it becomes a 'flag'.

- If 'True', the student received the award; if 'False', they have not.

In [46]:
mydataframe['awards'][1].count('A')>3

True

Now, we can wrap it altogether in a 'for' loop, and use a new temporary column as a flag for whether the condition was met.

In [47]:
mydataframe['AAA_award_filter'] = None #initialize a new column as a placeholder.
for i in range(0,len(mydataframe['awards'])): #for every row in the dataframe...
    mydataframe['AAA_award_filter'][i] = mydataframe['awards'][i].count('A')>3 #that new column becomes a flag of 'True' or 'False'.

mydataframe[mydataframe['AAA_award_filter']==True] #only select rows where column is true.

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

,name,age,score_math,score_language,awards,AAA_award_filter
1,Tom,25.0,0.90,0.91,"Scholarship, AAA Award",True
3,Sally,33.0,0.99,1.00,"Scholarship, AAA Award",True

Here is our result, showing which two students received an AAA Award.

_To better understand the python warning message above, see [Tutorial 1, "Assigning values to a dataframe: When to use 'at', versus 'loc', versus [col][row]"](https://nbviewer.jupyter.org/github/sherman6/tutorials/blob/master/Tutorial-01-Python-Basic_troubleshooting_and_usability_tips-v01.ipynb#third-bullet)_.

In [48]:
#dropping that 'flag' column, for illustration purposes. 
mydataframe = mydataframe.drop(columns='AAA_award_filter')

<a class="anchor" id="third-sub-bullet"></a>

___
___
___

## How to filter rows by a list of keywords (how to filter on multiple string values):

Here's how to select only rows which contain certain text, __for multiple values of text__.  
- This builds upon the previous method, shown above. 
- This is very convenient when you want to select only rows which contain certain text, and you have a list of keywords to search for. 
- Using this method, it's easy to add new keywords into your list. 
- It involves specifying a list of characters or keywords, which functions _like_ a 'dictionary', then searching for those items in your dataframe.  

___

Let's say we want to identify any students who had received any one of three awards; "AAA", "Scholarship", or "Resident" awards. 

Let's view our existing class of students and the awards they had received:

In [49]:
students_with_awards = mydataframe[['name','awards']]
students_with_awards

     name                  awards
0    John
1     Tom  Scholarship, AAA Award
2    Jane
3   Sally  Scholarship, AAA Award
4  Viktor             Scholarship
5   Jesus             Scholarship
6   Nadia
7  Carlos          Resident Award
8    Omar             Scholarship

First, we define a list of awards we are seeking to find (this list functions like a dictionary):

In [50]:
awardlist = ["AAA", "Scholar", "Resident Award"]

Next, we look for the presence of those awards within the 'awards' column, for each student in the class.  

- This involves creating a new temporary column to count the number of occurrences.
- This counts how many times any item from this list is found in the datafield we're searching within.
    - We'll be looking for our items within the 'awards' column.
    - We'll iterate through each item for each student, one student at a time.

In [51]:
#Count number of occurrences:

students_with_awards['Num_awards'] = pd.Series() #create placeholder column, of blank values (NaN). 
students_with_awards['Num_awards'] = students_with_awards['Num_awards'].fillna(0) #...Fill it with zeros. 

for i in range(0,len(students_with_awards)): #For each row in the data...
    for j in awardlist: #For each item in the dictionary... 
        students_with_awards.loc[i,'Num_awards']=   \
        students_with_awards.loc[i,'Num_awards'] +  \
        students_with_awards.loc[i, 'awards'].count(j)
        #...make the 'Num_awards' the count of occurrences of the item in 'awards'. 
        
students_with_awards

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until
C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  after removing the cwd from sys.path.
C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:543: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.obj[item] = s

     name                  awards  Num_awards
0    John                                 0.0
1     Tom  Scholarship, AAA Award         2.0
2    Jane                                 0.0
3   Sally  Scholarship, AAA Award         2.0
4  Viktor             Scholarship         1.0
5   Jesus             Scholarship         1.0
6   Nadia                                 0.0
7  Carlos          Resident Award         1.0
8    Omar             Scholarship         1.0

We now have a new column, which shows the number of awards each student received.

Now, we can simply filter on this.

In [52]:
students_with_awards.loc[students_with_awards['Num_awards']>=1]

     name                  awards  Num_awards
1     Tom  Scholarship, AAA Award         2.0
3   Sally  Scholarship, AAA Award         2.0
4  Viktor             Scholarship         1.0
5   Jesus             Scholarship         1.0
7  Carlos          Resident Award         1.0
8    Omar             Scholarship         1.0

We've identified all the students who had received any of the following awards; "AAA", "Scholarship", or "Resident".

<a class="anchor" id="fourth-bullet"></a>
___
___
___

## 4. Dataframes - Various Methods for Removing Rows & Missing Data:

To remove rows from a dataframe, or to create a new object which includes only certain rows from an existing dataframe, simply define your dataframe as that selection.


For more on how to select rows, see [the previous section](#third-bullet).

Here is our existing class of students:

In [53]:
mydataframe

     name   age  score_math  score_language                  awards
0    John  20.0        0.85            0.85
1     Tom  25.0        0.90            0.91  Scholarship, AAA Award
2    Jane  19.0         NaN            0.94
3   Sally  33.0        0.99            1.00  Scholarship, AAA Award
4  Viktor  45.0        0.97            0.82             Scholarship
5   Jesus  37.0        0.88            0.75             Scholarship
6   Nadia   NaN        0.79            0.89
7  Carlos  42.0        0.92            0.87          Resident Award
8    Omar  23.0        0.96            0.88             Scholarship

Let's say we only wanted the first 3 students, alphabetically by name.

In [54]:
df_smaller = mydataframe.sort_values(by=['name'], ascending=True)[0:3]
df_smaller

     name   age  score_math  score_language          awards
7  Carlos  42.0        0.92            0.87  Resident Award
2    Jane  19.0         NaN            0.94
5   Jesus  37.0        0.88            0.75     Scholarship

We just created a new dataframe, 'df_smaller', which includes only those 3 students.  
You could also change an existing dataframe:

In [55]:
df_smaller = df_smaller[0:2]
df_smaller

     name   age  score_math  score_language          awards
7  Carlos  42.0        0.92            0.87  Resident Award
2    Jane  19.0         NaN            0.94

___

Let's say we only want students that score high in math.

In [56]:
df_smaller = mydataframe.loc[mydataframe['score_math']>=.95]
df_smaller

     name   age  score_math  score_language                  awards
3   Sally  33.0        0.99            1.00  Scholarship, AAA Award
4  Viktor  45.0        0.97            0.82             Scholarship
8    Omar  23.0        0.96            0.88             Scholarship

### Removing Rows with Missing Data:

- _A missing value can be identified as_ `None`, `NaN`, `NaT`, _or simply blank (an empty string, such as `''`)_.
- _Note that you could instead impute missing values (or 'fill' them) with  `fillna()`. See above,  ['How to fill na's'](#first-bullet)_.

Let's look at a subset of our existing class of students. We see that it has some missing data in it:

In [57]:
ourdataframe = mydataframe[1:8].drop(columns=['awards','score_language']).reset_index(drop=True)
ourdataframe

     name   age  score_math
0     Tom  25.0        0.90
1    Jane  19.0         NaN
2   Sally  33.0        0.99
3  Viktor  45.0        0.97
4   Jesus  37.0        0.88
5   Nadia   NaN        0.79
6  Carlos  42.0        0.92

Here is how to remove rows with missing data.

In [58]:
print("length before: ",len(ourdataframe))
df_withoutNAs = ourdataframe.dropna()
print("length after: ",len(df_withoutNAs))

length before:  7
length after:  5

This removed all rows that are missing values for any datafields in the dataframe.  
Notice we started with 7 rows, and only 5 rows remain.

In [59]:
df_withoutNAs

     name   age  score_math
0     Tom  25.0        0.90
2   Sally  33.0        0.99
3  Viktor  45.0        0.97
4   Jesus  37.0        0.88
6  Carlos  42.0        0.92

- Notice that the row index numbers did not change - they remain as-is. 
    - Now, '1' and '5' are missing (they are now non-sequential).  
- This is because we did not reset the row index, which can be done by appending `.reset_index(drop=True)` onto the end of the `dropna()` command. 
- This will be discussed in more detail, [later on](#sixth-bullet).  

___

Another example, using different parameters of `dropna()`: 
- If we specify how=`all`, then it will only drop rows when ALL datafields are blank for that row. 
- by default, how=`any`, which drops rows with missing data in ANY datafield.

In [60]:
df_withoutNAs=ourdataframe.dropna(how='all', axis = 0)
df_withoutNAs['name']

0       Tom
1      Jane
2     Sally
3    Viktor
4     Jesus
5     Nadia
6    Carlos
Name: name, dtype: object

As we can see, no rows were removed, because none of them were blank for every column (all the way across).

Similarly, we could _drop columns_ instead, on the same criteria ("any" or "all"), by changing 'axis=0' to 'axis=1'.

___

How to remove rows which are missing data for one particular datafield:  

Let's remove only rows which are blank for 'age':

In [61]:
df_withoutNAs = ourdataframe.dropna(subset=['age'])
df_withoutNAs

     name   age  score_math
0     Tom  25.0        0.90
1    Jane  19.0         NaN
2   Sally  33.0        0.99
3  Viktor  45.0        0.97
4   Jesus  37.0        0.88
6  Carlos  42.0        0.92

We just removed the row '5', for 'Nadia', which had no value for column 'age'.

How to remove only rows which are blank for __either__ 'age' __OR__ 'score_math':

In [62]:
df_withoutNAs = ourdataframe.dropna(subset=['age','score_math'], how='any')
df_withoutNAs

     name   age  score_math
0     Tom  25.0        0.90
2   Sally  33.0        0.99
3  Viktor  45.0        0.97
4   Jesus  37.0        0.88
6  Carlos  42.0        0.92

We just removed the rows for 'Nadia' and 'Jane', which had missing values in those columns.  
- Note, specifying `how='any'` is only for illustration purposes only; 
- Not specifying this would deliver the same result, as `how='any'` by default.

For more information on `dropna()`, such as thresholds and in-place operations, see https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html

<a class="anchor" id="fifth-bullet"></a>
___
___
___

## 5. Dataframes - The Importance of Row Indexing:

A lot of problems people encounter when coding in Python arise from __improper row indexing__.  

Improper indexing can be evident when any of the following exist...  
1. __Duplicate index numbers__ (where the index is not unique), 
2. __Missing index values__ (where an index number is skipped, or can't be found in the dataframe), or 
3. __Out-of-order index numbers__ (non-sequential numbers).

These issues can often be resolved by re-setting the index of the rows.  Let's go through a few examples of how errors might occur, and why:  

___

Let's say we appended more rows to a dataframe, but for whatever reason, we didn't reset the index:

Our original dataframe:

In [63]:
df_original = mydataframe[0:4].drop(columns=['score_math','score_language','awards'])
df_original

    name   age
0   John  20.0
1    Tom  25.0
2   Jane  19.0
3  Sally  33.0

Our rows to append:

In [64]:
df_newstudents = pd.DataFrame({'name':['Marly','Hakkan'], 'age':[28, 39]})
df_newstudents

     name  age
0   Marly   28
1  Hakkan   39

Notice that the default index starts at 0 for both dataframes. 


Let's join the cases together, and NOT reset the index (for illustration):

In [65]:
new_df = df_original.append(df_newstudents) #Appending new rows to a dataframe
new_df

     name   age
0    John  20.0
1     Tom  25.0
2    Jane  19.0
3   Sally  33.0
0   Marly  28.0
1  Hakkan  39.0

Notice that the row indexes for the appended rows still start at '0', and are NOT a continuation of the previous dataframe's listing.  


- 'Marly' and 'Hakkan' start at index # 0, even though 'John' and 'Tom' also start at index # 0.  
- Both 'Hakkan' and 'Tom' share the index number '1'. 
- In this sense, __the row index is non-unique__.  

__This becomes problematic when operating on this dataframe with 'for' loops, as well as when attempting to use index-based selection.__ 

___

For example, with the above dataframe, which has non-unique row index values, we cannot use the index to properly select rows.  
- If we try to select just the rows which have index 0 or 1, we'll only get the first-occurring row with that index.

In [66]:
new_df[0:2]

   name   age
0  John  20.0
1   Tom  25.0

As per above, we only got 2 rows, even though there are 4 rows which have an index of 0 or 1.

Specifying "more" rows (higher numbers) "works", but only as a rough method, because it calls the _position_ of the row (and not the index #):

In [67]:
new_df[4:6]

     name   age
0   Marly  28.0
1  Hakkan  39.0

We cannot properly select the second 'index 0' row, or the second 'index 1' row, because the index is not unique.

__For example, let's say we wanted to assign data to rows by their index, when the index is not unique.__

- __Result:__ This will change the values __for all rows which share that index.__

Let's return to our earlier example. Notice that 'Marly' and 'John' both have an index number of '0'.

In [68]:
new_df

     name   age
0    John  20.0
1     Tom  25.0
2    Jane  19.0
3   Sally  33.0
0   Marly  28.0
1  Hakkan  39.0

Watch what happens when we try to edit John's data.

In [69]:
new_df.loc[0,'name'] = "Jonathan" 
new_df.loc[0,'age'] = 21

In [70]:
new_df

       name   age
0  Jonathan  21.0
1       Tom  25.0
2      Jane  19.0
3     Sally  33.0
0  Jonathan  21.0
1    Hakkan  39.0

We ended up __accidentally changing values for BOTH rows__ (for both 'John' and 'Marly').  
- __Now, we have TWO 'Jonathan's__!  
- This wasn't our intention, so it's not ideal.

___

__Improper row indexing is also problematic when using 'for' loops, and can cause a lot of frustration if not caught early.__

Let's return to our earlier example.

In [71]:
new_df

       name   age
0  Jonathan  21.0
1       Tom  25.0
2      Jane  19.0
3     Sally  33.0
0  Jonathan  21.0
1    Hakkan  39.0

Let's attempt a simple for-loop:

In [72]:
for i in len(new_df):
    print(new_df.loc[i,'name'])

TypeError: 'int' object is not iterable

We receive the error that the object is not iterable. This is because the there are duplicate row index numbers.

Re-indexing the dataframe would fix this. 
___

Even if we use a different range (`range(0,len(new_df))`), we'll still get an error.

In [73]:
for i in range(0,len(new_df)):
    print(new_df.loc[i,'name'])

0    Jonathan
0    Jonathan
Name: name, dtype: object
1       Tom
1    Hakkan
Name: name, dtype: object
Jane
Sally

KeyError: 4

We receive this lengthy error message because the there are duplicate row index numbers.

Re-indexing the dataframe would fix this.

___

__An error would also occur if an index value is missing, such as, if a row was removed.__

Let's use this dataframe `df_withoutNAs` as an example, where we have dropped rows with missing data and didn't re-index:

In [74]:
df_withoutNAs = mydataframe[1:8].drop(columns=['score_language','awards'])
df_withoutNAs = df_withoutNAs.dropna()
df_withoutNAs = df_withoutNAs.drop(columns=['score_math'])
df_withoutNAs

     name   age
1     Tom  25.0
3   Sally  33.0
4  Viktor  45.0
5   Jesus  37.0
7  Carlos  42.0

Notice that the row index numbers are non-sequential.  
- Index numbers 2 and 6 are missing, because those rows were removed when we dropped missing data.

Let's attempt a simple for-loop:

In [75]:
for i in range(len(df_withoutNAs)):
    print(df_withoutNAs.loc[i,'name'])

KeyError: 0

This lengthy error occurs because there is no row 2 or row 6.  
- The for-loop cycled through 1, 2, 3, 4, 5, 6, 7, and didn't find those values. 
- For example, if we were to manually specify the iteration #s we wanted the for-loop to act upon, then we could "get around" it, but this would be impractical.

In [76]:
for i in (1,3,4,5,7):
    print(df_withoutNAs.loc[i,'name'])

Tom
Sally
Viktor
Jesus
Carlos

Re-indexing the dataframe would fix this.

___

### Out-of-order indexes (non-sequential index numbers) can also cause confusion, if not identified early on:

For example, let's say we re-ordered the rows of the dataframe, and didn't re-index:

In [77]:
df_out_of_order = mydataframe[1:4].drop(columns=['score_language','awards','score_math'])
df_out_of_order = df_out_of_order.append(pd.DataFrame({'name':['John'], 'age':[20]}))  
df_out_of_order

    name   age
1    Tom  25.0
2   Jane  19.0
3  Sally  33.0
0   John  20.0

Notice that the row index numbers are __out of order__.  
- Index number 0 ('John') is last, not first, like we expect.  

When we try a for-loop, however, it cycles through the index numbers sequentially, meaning that '0' will be operated on first, followed by, 1, 2, and 3.

In [78]:
for i in range(len(df_out_of_order)):
    print(df_out_of_order.loc[i,'name'])

John
Tom
Jane
Sally

The results of the for-loop are __not in the same order__ as the dataframe, which can cause confusion and errors down the road. 
- The for-loop cycled through 0, 1, 2, 3, in that order, even though '0' comes last in our dataframe. 
- If we were to manually specify the order of iterations we wanted the for-loop to act upon,  we could "get around" this, but it is impractical.

In [79]:
for i in(1,2,3,0):
    print(df_out_of_order.loc[i,'name'])

Tom
Jane
Sally
John

Re-indexing the dataframe would fix this.

In [80]:
df_out_of_order = df_out_of_order.reset_index()

for i in range(len(df_out_of_order)):
    print(df_out_of_order.loc[i,'name'])

Tom
Jane
Sally
John

<a class="anchor" id="sixth-bullet"></a>
___
___
___

## How to reset row indices:

Here's how to reset a dataframe's row index, which resolves many problems associated with improper indexing (as previously shown).

Let's take our dataframe, where the row index is improper (notice 0 and 1 are repeated for 'Marly' and 'Hakkan').

In [81]:
new_df

       name   age
0  Jonathan  21.0
1       Tom  25.0
2      Jane  19.0
3     Sally  33.0
0  Jonathan  21.0
1    Hakkan  39.0

Now, let's reset the index.

In [82]:
new_df_reindexed = new_df.reset_index()
new_df_reindexed

   index      name   age
0      0  Jonathan  21.0
1      1       Tom  25.0
2      2      Jane  19.0
3      3     Sally  33.0
4      0  Jonathan  21.0
5      1    Hakkan  39.0

__The row index is now in the proper format:__ it has no duplicate values, is sequential, and in order.  

- There is a new column called 'index', because when we reset the index, we did not 'drop' the old index.  
- This way, it is there for historical purposes, in case we ever needed to match up a row with the original dataset. 

___

How to remove the original row index (if you don't want to keep it):

In [83]:
new_df_reindexed = new_df.reset_index(drop=True)
new_df_reindexed

       name   age
0  Jonathan  21.0
1       Tom  25.0
2      Jane  19.0
3     Sally  33.0
4  Jonathan  21.0
5    Hakkan  39.0

__How to drop na's, re-index rows, and drop old row index, all in one step__: 

Let's start with a simple dataframe, with 6 cases of data (2 of which have missing values).

In [84]:
smaller_dataframe = mydataframe[1:7].drop(columns=['awards','score_language']).reset_index(drop=True)
smaller_dataframe

     name   age  score_math
0     Tom  25.0        0.90
1    Jane  19.0         NaN
2   Sally  33.0        0.99
3  Viktor  45.0        0.97
4   Jesus  37.0        0.88
5   Nadia   NaN        0.79

Now, let's perform the operation:

In [85]:
smaller_dataframe_reindexed = smaller_dataframe.dropna().reset_index(drop=True)
smaller_dataframe_reindexed

     name   age  score_math
0     Tom  25.0        0.90
1   Sally  33.0        0.99
2  Viktor  45.0        0.97
3   Jesus  37.0        0.88

We just completed 3 steps:  drop rows with missing data anywhere, re-index the dataframe, and drop the old index which we don't need anymore.

- _Although we didn't need the old index our case, there are many scenarios where the old index is helpful_.

For more information, see https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.reset_index.html.

<a class="anchor" id="seventh-bullet"></a>
___
___
___

## 6. Dataframes - Appending and Removing Columns, & Why Data Type Matters:

## Adding variables (columns):

Let's say we wanted to add a placeholder column for some new data, such as a new variable.

Let's say we have this dataframe to start:

In [86]:
df_original = mydataframe[0:5].drop(columns=['age','awards'])
df_original

     name  score_math  score_language
0    John        0.85            0.85
1     Tom        0.90            0.91
2    Jane         NaN            0.94
3   Sally        0.99            1.00
4  Viktor        0.97            0.82

Let's say we wanted to add a blank, placeholder column for how many classes each student is taking.  
We don't know how many classes they are taking, and have to ask them, first.

In [87]:
df_original['num_classes'] = None
df_original

     name  score_math  score_language num_classes
0    John        0.85            0.85        None
1     Tom        0.90            0.91        None
2    Jane         NaN            0.94        None
3   Sally        0.99            1.00        None
4  Viktor        0.97            0.82        None

We see that we've created a placeholder column where new data can go.  

We asked each student, and it turns out they all take 3 classes. We can now assign this.

In [88]:
df_original['num_classes'] = 3
df_original

     name  score_math  score_language  num_classes
0    John        0.85            0.85            3
1     Tom        0.90            0.91            3
2    Jane         NaN            0.94            3
3   Sally        0.99            1.00            3
4  Viktor        0.97            0.82            3

Note, this code would work equally well without creating a placeholder column first (another example below).   

- However, it is good practice to get into this habit, because placeholder objects need to be defined first in 'for' loops.
- In dataframes, you have to initialize new columns before using a for-loop to assign values into them.

Let's say we wanted to add a column to show the average score for each student, based on their math and language scores.

In [89]:
df_original['average_score'] = (df_original['score_math'] + df_original['score_language']) / 2
df_original

     name  score_math  score_language  num_classes  average_score
0    John        0.85            0.85            3          0.850
1     Tom        0.90            0.91            3          0.905
2    Jane         NaN            0.94            3            NaN
3   Sally        0.99            1.00            3          0.995
4  Viktor        0.97            0.82            3          0.895

As discussed, we didn't need to create a placeholder column first in the above example. 

___

<a class="anchor" id="seventh-sub1-bullet"></a>
___
___
___

## There are several ways to create 'blank' columns. Why variable type matters:  

In dataframes, new columns must be first initialized before using for-loops to assign values into them.  They can be initialized with a default value (`=3`, `="True"`, `= 12/25/2019`), or be blank, in order to accept new data. 

___

- Specifying a new column as `=None` is the simplest (crudest?) way to make it 'blank' (no value), because it doesn't specify a variable type for the cells to take on. 
    - This way, no other data type can be added to it (numeric, categorical, or string), until it is assigned one of those types.
    
    
- Specifying `=pd.Series()` implies that it is a numeric placeholder. This specifies it as a numeric variable type. 
- Specifying `=''` implies that it is a string variable (variable type is assigned).
- Specifying `pd.NaT` implies that it is a date placeholder. This makes the variable a 'date' type.

In [90]:
df_original['num_classes'] = None

In [91]:
df_original.loc[1,'num_classes']

Notice, nothing prints, because nothing is there. Essentially, we asked: "don't return anything".

In [92]:
type(df_original.loc[1,'num_classes'])

NoneType

This is the simplest/crudest way.

___
Specifying `=pd.Series()` implies that it is a numeric placeholder. This specifies it as a numeric variable type.

In [93]:
df_original['num_classes'] = pd.Series()

In [94]:
df_original.loc[1,'num_classes']

nan

In [95]:
type(df_original.loc[1,'num_classes'])

numpy.float64

___
Specifying `=''` implies that it is a string variable (variable type is assigned).

In [96]:
df_original['num_classes'] = ""

In [97]:
df_original.loc[1,'num_classes']

''

In [98]:
type(df_original.loc[1,'num_classes'])

str

___
Specifying `=pd.NaT` implies that it is a date placeholder. This makes the variable a 'date' type.

In [99]:
df_original['num_classes'] = pd.NaT

In [100]:
df_original.loc[1,'num_classes']

NaT

In [101]:
type(df_original.loc[1,'num_classes'])

pandas._libs.tslibs.nattype.NaTType

___

__This becomes import when assigning values to the dataframe.__ 

For example, if you try to assign a data type that doesn't fit, you'll get an error message.

- To demonstrate, let's assign a missing value of numeric type:

In [102]:
df_original['num_classes'] = pd.Series()

In [103]:
df_original.loc[1,'num_classes']

nan

In [104]:
type(df_original.loc[1,'num_classes'])

numpy.float64

Let's try to add 3 to this, as if the student just joined 3 new classes.

In [105]:
df_original.loc[1,'num_classes'] = df_original.loc[1,'num_classes'] + 3

In [106]:
df_original.loc[1,'num_classes']

nan

In [107]:
type(df_original.loc[1,'num_classes'])

numpy.float64

The result is still 'nan', and there was no error (there was no conflict between data types).

- However, now let's assign a missing value of string type:

In [108]:
df_original['num_classes'] = ''

In [109]:
df_original.loc[1,'num_classes']

''

In [110]:
type(df_original.loc[1,'num_classes'])

str

Let's try to add 3 to this, as if the student just joined 3 new classes.

In [111]:
df_original.loc[1,'num_classes'] = df_original.loc[1,'num_classes'] + 3

TypeError: can only concatenate str (not "int") to str

The result is still blank (""), but this gives us an error, because the data type is different.

In [112]:
df_original.loc[1,'num_classes']

''

In [113]:
type(df_original.loc[1,'num_classes'])

str

We would encounter similar errors for other types of missing values which imply a data type:

In [114]:
df_original['num_classes'] = None
type(df_original.loc[1,'num_classes'])

NoneType

In [115]:
df_original.loc[1,'num_classes'] = df_original.loc[1,'num_classes'] + 3

TypeError: unsupported operand type(s) for +: 'NoneType' and 'int'

We get an error, because the data types conflict. 

This is why variable type matters, even for missing values.

<a class="anchor" id="seventh-sub2-bullet"></a>
___
___
___


## Dropping (removing) columns:

Let's start with a simple dataframe:

In [116]:
ourdataframe = mydataframe[1:4].reset_index(drop=True)
ourdataframe

    name   age  score_math  score_language                  awards
0    Tom  25.0        0.90            0.91  Scholarship, AAA Award
1   Jane  19.0         NaN            0.94
2  Sally  33.0        0.99            1.00  Scholarship, AAA Award

How to drop multiple columns at once, by name:

In [117]:
smaller_dataframe = ourdataframe.drop(columns=['age','awards','score_language'])
smaller_dataframe

    name  score_math
0    Tom        0.90
1   Jane         NaN
2  Sally        0.99

You can even drop an extra index this way.   
- For example, if we had removed rows with missing data, and retained the index as it's own column, we'd be left with an extra index column.

In [118]:
smaller_dataframe = smaller_dataframe.dropna().reset_index()
smaller_dataframe

   index   name  score_math
0      0    Tom        0.90
1      2  Sally        0.99

- Now, we can just remove 'index':

In [119]:
smaller_dataframe = smaller_dataframe.drop(columns=['index'])
smaller_dataframe

    name  score_math
0    Tom        0.90
1  Sally        0.99

Another method:

How to drop a single column, by name:

In [120]:
# Gives all columns except this one:
smaller_dataframe = ourdataframe.loc[:, ourdataframe.columns != 'awards']
smaller_dataframe

    name   age  score_math  score_language
0    Tom  25.0        0.90            0.91
1   Jane  19.0         NaN            0.94
2  Sally  33.0        0.99            1.00

Another method:

How to only keep certain columns, and drop all others:

In [121]:
smaller_dataframe = ourdataframe[['name','score_language',]] 
smaller_dataframe

    name  score_language
0    Tom            0.91
1   Jane            0.94
2  Sally            1.00

This command also allows you to re-order the columns.

___

How to drop columns with missing data using `dropna()`: 
- Set `axis=1`  
- If we specify how=`any`, we will drop columns which have any rows with missing data in them.  If 1 row is missing data for that column, it will be dropped. 
- If we specify how=`all`, then we will only drop columns when ALL rows are blank for that datafield.

In [122]:
mydataframe

     name   age  score_math  score_language                  awards
0    John  20.0        0.85            0.85
1     Tom  25.0        0.90            0.91  Scholarship, AAA Award
2    Jane  19.0         NaN            0.94
3   Sally  33.0        0.99            1.00  Scholarship, AAA Award
4  Viktor  45.0        0.97            0.82             Scholarship
5   Jesus  37.0        0.88            0.75             Scholarship
6   Nadia   NaN        0.79            0.89
7  Carlos  42.0        0.92            0.87          Resident Award
8    Omar  23.0        0.96            0.88             Scholarship

We see that 'age' and 'score_math' each have at least one row with missing data for that variable.

In [123]:
df_withoutNAs = mydataframe.dropna(how='any', axis = 1)
df_withoutNAs

     name  score_language                  awards
0    John            0.85
1     Tom            0.91  Scholarship, AAA Award
2    Jane            0.94
3   Sally            1.00  Scholarship, AAA Award
4  Viktor            0.82             Scholarship
5   Jesus            0.75             Scholarship
6   Nadia            0.89
7  Carlos            0.87          Resident Award
8    Omar            0.88             Scholarship

Now, those columns with missing data are removed.

Similarly, we could drop rows instead, on the same criteria ("any" or "all"), by changing 'axis=1' to 'axis=0'.

For more information on `dropna()`, such as thresholds and in-place operations, see https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html

<a class="anchor" id="eighth-bullet"></a>
___
___
___

## 7. Dataframes - Merging and Joining Dataframes (A Simple Primer)

This is a simple primer on merging and joining dataframes in pandas. There are [so many ways to join and merge dataframes together](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html), and so many optional parameters one can use, that it could warrant it's own tutorial.  

_For 'merging' two datasets together in terms of appending new cases, see the previous section, ['Appending New Rows'](#second-bullet)._

___

Let's say we have two datasets, "A" and "B".

In [124]:
A = pd.DataFrame({'name': ['John','Tom','Jane','Omar'],'age': [20, 25, 19, 23]})
B = pd.DataFrame({'name': ['John','Tom','Jane','Omar'],'score_math': [.85, .90, None, .96]})

___

Merging together:

In [125]:
AwithB = A.merge(B)
AwithB

   name  age  score_math
0  John   20        0.85
1   Tom   25        0.90
2  Jane   19         NaN
3  Omar   23        0.96

This method, `merge()`, is the easiest way to ignore indices, columns with duplicate names, and column/row keys.  
It just smashes columns together.

___

Joining together:

In [126]:
AwithB = A.join(B, rsuffix='_B')
AwithB

   name  age name_B  score_math
0  John   20   John        0.85
1   Tom   25    Tom        0.90
2  Jane   19   Jane         NaN
3  Omar   23   Omar        0.96

This method, `join()`, also works, and is geared more towards joining dataframe columns either on an index or a key column.  
It supports different options.

___

__By comparison:__

Simple columnar addition will cause missing data errors (just smashing two columns together):

In [127]:
AwithB = A+B
AwithB

   age      name  score_math
0  NaN  JohnJohn         NaN
1  NaN    TomTom         NaN
2  NaN  JaneJane         NaN
3  NaN  OmarOmar         NaN

As shown above, the column that was added, 'score_math', has missing data. 

A simple (yet verbose) alternative:

In [128]:
AwithB = A
AwithB['score_math'] = B['score_math']
AwithB

   name  age  score_math
0  John   20        0.85
1   Tom   25        0.90
2  Jane   19         NaN
3  Omar   23        0.96

This is more-time consuming alternative than either `join()` or `merge()` (they would be easier and better).

For more information on pandas joins and merges, see the Appendix.

<a class="anchor" id="appendix"></a>
___

# Appendix:

___

<a class="anchor" id="reference"></a>

### References:

[1] https://www.burtchworks.com/2019/08/21/2019-sas-r-or-python-survey-update-which-tool-do-data-scientists-analytics-pros-prefer/

[2]  https://pandas.pydata.org/pandas-docs/stable/index.html#

### More Resources:

- https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html
    - The official Pandas website, with 'how to's' on indexing and selecting data.  
- https://pandas.pydata.org/pandas-docs/stable/getting_started/comparison/comparison_with_r.html
    - The official Pandas website contains this great reference page displaying comparable code and libraries between Python's Pandas, and R / R libraries.  
- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html
    - More information on removing rows/columns with missing data.  
- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.fillna.html
    - More information on simple methods to impute missing data (fill it with values).  
- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html
    - More information on sorting/ranking dataframes, along either axis.
- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html
    - More information on how to merge dataframes with a database-style join.
- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.join.html#pandas.DataFrame.join
    - More information on how to join dataframe columns either on an index or a key column.

### Machine Information:  

This workbook was run on...

In [129]:
#Python Version:
import sys
print(sys.version)

3.7.3 (default, Apr 24 2019, 15:29:51) [MSC v.1915 64 bit (AMD64)]

In [130]:
#Timestamp:
import datetime
datetime.datetime.now().strftime("%a, %d %B %Y %H:%M:%S")

'Fri, 27 March 2020 17:21:15'

In [131]:
#Operating System:
import os
print(os.name)
print(sys.platform)

nt
win32


___

_Sherman6,  2020 March_

___